# Essential packages
brew "git"
brew "fish"
brew "starship"

# Development tools
brew "curl"
brew "wget"
brew "jq"
brew "tree"
brew "htop"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "fzf"

# Git and GPG tools
brew "gh"
brew "git-lfs"
brew "gpg"
brew "gnupg"
brew "pinentry-mac"

# Programming languages and tools
brew "go"

# Utilities
brew "defaultbrowser"

# GUI applications
cask "google-chrome"
cask "font-fira-code-nerd-font"
cask "rectangle"
# Note: Alacritty cask is deprecated, install manually from https://github.com/alacritty/alacritty
cask "localsend"
cask "1password"
cask "visual-studio-code"
cask "obsidian"

# Go packages
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"

# Rust packages
cargo "cargo-edit"
