tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "vim"
brew "neovim"
brew "postgresql"
brew "wget"
brew "jq"
brew "thefuck"
brew "htop"
brew "docker"

cask "1password"
cask "manico"
cask "iterm2"
cask "postman"
cask "postico"
cask "spotify"
cask "discord"
cask "font-fira-code"
cask "brave-browser"

cask "visual-studio-code"
cask "microsoft-teams"
cask "slack"
